# SQL NOTES

The ESC403 cluster comes with [Catherine Devlin's `%sql`-magic for IPython][1]; this allows you to run SQL queries from the IPython notebook, and intermix them with Python code.

[1]: https://github.com/catherinedevlin/ipython-sql

Before we can use the `%sql` syntax, two steps must be taken:

* Load the IPython-SQL bridge code

In [2]:
%load_ext sql

* Connect to an actual database; this must be the first `%sql` statement (the funny `rmurri@/lustre` syntax is correct and means "connect to the PostGreSQL DB named `lustre` running on *this* host as user `rmurri`"  -- please replace `rmurri` with your local user name):

In [3]:
%sql postgresql://mivkov@/lustre

u'Connected: mivkov@lustre'

Now you can run 1-line SQL queries by prefixing them with `%sql`:

In [4]:
%sql select * from lustre limit 5;

5 rows affected.

[(u'usr388', u'i5105', 1384452271, 1384452271, 4, 2203L, u'/scratch/bioc/usr388/VS_AllNow_libo_3WAT/ledock_pose/LIBO00170060_dock014.pdb'),
 (u'usr388', u'i5105', 1384452311, 1384452311, 4, 1708L, u'/scratch/bioc/usr388/VS_AllNow_libo_3WAT/ledock_pose/LIBO00171011_dock014.pdb'),
 (u'usr388', u'i5105', 1384452490, 1384452490, 4, 1213L, u'/scratch/bioc/usr388/VS_AllNow_libo_3WAT/ledock_pose/LIBO00174084_dock006.pdb'),
 (u'usr388', u'i5105', 1384452674, 1384452674, 4, 1488L, u'/scratch/bioc/usr388/VS_AllNow_libo_3WAT/ledock_pose/LIBO00179374_dock004.pdb'),
 (u'usr388', u'i5105', 1384453267, 1384453267, 4, 1708L, u'/scratch/bioc/usr388/VS_AllNow_libo_3WAT/ledock_pose/LIBO00205410_dock007.pdb')]

It is also possible to run multi-line (or multiple) SQL queries by using the `%%sql` syntax instead.  Note that in this case the SQL instructions *must not* be on the same line as the `%%sql` magic marker:







# Selection

The SELECT statement is used to compute expressions in SQL. The result of evaluating a SELECT statement is again a relation (table). It allows composition of queries into larger expressions.

In [5]:
#------------------------
# Strings: single quotes
#------------------------

%sql select 'something'

1 rows affected.

[('something',)]

In [6]:
%sql select 'some string' as "column name"

1 rows affected.

[('some string',)]

Multiple expressions can be evaluated by separating them with a comma. They define different columns in the result table.

In [7]:
%sql select 'foo', 'bar'

1 rows affected.

[('foo', 'bar')]

SELECT ... FROM ... WHERE returns a relation of all rows in a table that satisfy a certain predicate.

\* is a shorthand for “all column names”.
limit INT shows only the (first) INT columns.

In [10]:
%%sql

/* comments are done this way. */
/* must be after %%sql */
-- or like this

----------------------------------------
-- select from a database
----------------------------------------

select * 
from lustre_sample
-- limit the number of columns used/printed
limit 3

3 rows affected.

[(u'usr264', u'i5285', 1379422142, 1379422142, 10692, 10942224L, u'/scratch/iftp/usr264/girichidis_like_22.7/version_456_lowres/output_00064/grav_00064.out00005'),
 (u'usr264', u'i5285', 1379423438, 1379423438, 6668, 6827216L, u'/scratch/iftp/usr264/girichidis_like_22.7/version_456_lowres/output_00065/amr_00065.out00090'),
 (u'usr264', u'i5285', 1379423438, 1379423439, 12840, 13142380L, u'/scratch/iftp/usr264/girichidis_like_22.7/version_456_lowres/output_00065/hydro_00065.out00001')]

In [11]:
%%sql 
select * 
from lustre_sample 
where usr='usr388' -- pick specific rows
limit 3

3 rows affected.

[(u'usr388', u'i5105', 1384515907, 1384515907, 4, 1488L, u'/scratch/bioc/usr388/VS_AllNow_libo_3WAT_end/d353/LIBO00362035_dock002.pdb'),
 (u'usr388', u'i5105', 1384515910, 1384515910, 4, 2313L, u'/scratch/bioc/usr388/VS_AllNow_libo_3WAT_end/d353/LIBO00362130_dock006.pdb'),
 (u'usr388', u'i5105', 1384515910, 1384515910, 4, 1488L, u'/scratch/bioc/usr388/VS_AllNow_libo_3WAT_end/d353/LIBO00362156_dock007.pdb')]

In [12]:
%%sql 
select * 
from lustre_sample 
where size>=100000000000 -- pick specific rows
limit 3

3 rows affected.

[(u'usr25', u'i5105', 1375180846, 1375187555, 338012444, 346124300004L, u'/scratch/bioc/usr25/fegs/syk/coor.bin'),
 (u'usr345', u'i5535', 1393549458, 1392930066, 136481476, 139756472534L, u'/scratch/aim/usr345/bams/recal/PA_A955_recal.bam'),
 (u'usr345', u'i5535', 1393549452, 1392940968, 124641616, 127632540122L, u'/scratch/aim/usr345/bams/recal/PP_A939_recal.bam')]

In [13]:
%%sql
select *
from lustre_sample
where length(path) = 102 -- pick specific rows
limit 3

3 rows affected.

[(u'usr345', u'i5535', 1391658149, 1391658149, 4, 773L, u'/scratch/aim/usr345/bwa/output_phase2/PA_A964/C00W1ABXX_F_6_sorted_marked_realigned_fastqc/summary.txt'),
 (u'usr345', u'i5535', 1391651630, 1391651630, 4, 773L, u'/scratch/aim/usr345/bwa/output_phase2/PP_A942/81MD6ABXX_E_4_sorted_marked_realigned_fastqc/summary.txt'),
 (u'usr345', u'i5535', 1391666264, 1391666264, 4, 773L, u'/scratch/aim/usr345/bwa/output_phase2/PP_A942/C002LABXX_F_3_sorted_marked_realigned_fastqc/summary.txt')]

In [17]:
%%sql
---------------------------------
-- select only certain columns 
---------------------------------

select usr,size
from lustre_sample
limit 3

3 rows affected.

[(u'usr264', 10942224L), (u'usr264', 6827216L), (u'usr264', 13142380L)]

In [18]:
%%sql
------------------------------
--select only unique rows
------------------------------

select distinct usr
from lustre_sample
limit 3

3 rows affected.

[(u'usr25',), (u'usr324',), (u'usr234',)]

In [19]:
%%sql
------------------------------
-- select only unique rows
------------------------------

select distinct usr,size
from lustre_sample
limit 3

3 rows affected.

[(u'us293', 258L), (u'us293', 260L), (u'us293', 261L)]

# Ordering

In [20]:
%%sql

------------------------------------
-- order by column usr, ascending
------------------------------------

select distinct usr
from lustre_sample
order by usr asc
limit 3

3 rows affected.

[(u'us293',), (u'us319',), (u'us320',)]

In [21]:
%%sql
------------------------------------
-- order by column usr, descending
------------------------------------

select distinct usr
from lustre_sample
order by usr desc
limit 3

3 rows affected.

[(u'usr75',), (u'usr394',), (u'usr390',)]

# Aggregate functions

By default, aggregation is over all selected rows. 

A GROUP BY clause can be used to specify how rows should be grouped; expressions involving aggregate functions will be computed once per each group.

An additional HAVING clause applies a predicate to further select groups based on some expression.

In [22]:
#----------
# average
#----------
%sql select avg(size) from lustre_sample

1 rows affected.

[(Decimal('5170994.219224082372'),)]

In [23]:
#--------
# max
#--------
%sql select max(size) from lustre_sample

1 rows affected.

[(346124300004L,)]

In [24]:
#---------
# min
#---------

%sql select min(size) from lustre_sample

1 rows affected.

[(0L,)]

In [25]:
#----------
# count
#----------
%sql select count(size) from lustre_sample

1 rows affected.

[(1519053L,)]

In [26]:
%%sql 
------------------------------------
-- Grouping rows together first
------------------------------------

select usr, avg(size) 
from lustre_sample 
group by usr 
limit 3

3 rows affected.

[(u'usr25', Decimal('90882260.016532721010')),
 (u'usr324', Decimal('1942829.153247914184')),
 (u'usr234', Decimal('1336169.992317148125'))]

In [27]:
%%sql

--------------------------------------------------------------------------------------------------------------
-- compute average file size per user, but only consider users that have at least 10000 files on the system 
--------------------------------------------------------------------------------------------------------------

select usr, avg(size) 
from lustre_sample 
group by usr 
having count(path)>10000
limit 3

3 rows affected.

[(u'usr324', Decimal('1942829.153247914184')),
 (u'usr246', Decimal('3621718.400295508274')),
 (u'usr264', Decimal('21193713.232901487469'))]

# Creating, deleting, altering, updating tables

In [49]:
%%sql

--------------------
-- creating tables
--------------------

create table myMovieTable(              -- also possible: create temporary table (deleted after session)
        title         varchar(256),     -- string of up to 256 chars, padded with spaces
        length        bigint,           -- long integer; also integer, smallint
        rating        float ,           -- floating point number; also real, double precision
        release_date  date              -- date; also time, timestamp
        )

Done.

[]

In [50]:
%%sql

-------------------------------
-- inserting stuff into tables
-------------------------------

insert into myMovieTable(title,length,rating,release_date)
VALUES ('Star Wars', 124, 8.7, DATE '1977-05-25');

-- print table out

select * from myMovieTable limit 5

1 rows affected.
1 rows affected.

[(u'Star Wars', 124L, 8.7, datetime.date(1977, 5, 25))]

In [53]:
%%sql

---------------------------------------
-- update a value in an existing row
---------------------------------------

-- Here: update rating
    
update myMovieTable
set "rating"=9.2 where "title"='Star Wars';

select * from myMovieTable;

1 rows affected.
1 rows affected.

[(u'Star Wars', 124L, 9.2, datetime.date(1977, 5, 25))]

In [51]:
%%sql

-------------------------------------------------------------------
-- insert stuff into table from some other table with conditions
-------------------------------------------------------------------
-- Here: create new table, copy file paths from lustre_sample where filezise > 10000

create temporary table someTable(
            path varchar(256),
            size bigint);

insert into someTable (path, size)
select path,size from lustre_sample
where size>10000;

select * from someTable
limit 5

Done.
547554 rows affected.
5 rows affected.

[(u'/scratch/iftp/usr264/girichidis_like_22.7/version_456_lowres/output_00064/grav_00064.out00005', 10942224L),
 (u'/scratch/iftp/usr264/girichidis_like_22.7/version_456_lowres/output_00065/amr_00065.out00090', 6827216L),
 (u'/scratch/iftp/usr264/girichidis_like_22.7/version_456_lowres/output_00065/hydro_00065.out00001', 13142380L),
 (u'/scratch/iftp/usr264/girichidis_like_22.7/version_456_lowres/output_00065/hydro_00065.out00015', 6227500L),
 (u'/scratch/iftp/usr264/girichidis_like_22.7/version_456_lowres/output_00065/sink_00065.out', 24387L)]

In [54]:
#################
# Delete tables
#################
%sql drop table myMovieTable
%sql drop table someTable

Done.
Done.

[]

In [58]:
%%sql

----------------------------------------------------------------------------
-- copy only 1 column from some other table into a table with existing rows
----------------------------------------------------------------------------

-- first, create some table
create temporary table someTable(
            path varchar(256),
            size bigint);


-- give it some values
insert into someTable (path, size)
select path,size from lustre_sample
where size>1000000;


-- add column
alter table someTable add atime bigint;


-- populate additional column
update someTable
set atime=orig.atime from lustre_sample as orig
where someTable.path=orig.path;

--print
select * from someTable limit 5

Done.
225610 rows affected.
Done.
225610 rows affected.
5 rows affected.

[(u'/scratch/id/usr116/lustre-troubles.tar.bz2', 62544031L, 1380982306L),
 (u'/scratch/iftp/usr264/sphydro/histo.txt', 2920600L, 1343034189L),
 (u'/scratch/iftp/usr264/box/map1.txt', 19138048L, 1335441653L),
 (u'/scratch/aim/usr345/bams/recal/PA_A947.calibrations.grp', 5414305L, 1393370100L),
 (u'/scratch/aim/usr345/psmc/psmc/reheadered_mbq20/PP_KB5543_reheadered_cleaned_raw.psmcfa', 21826828L, 1388814502L)]

In [57]:
%sql drop table sometable

Done.

[]

# Miscelanneous Notes

* Each table in a SQL database is given a name (at creation time).